7767517
113 131
Input                    in0                      0 1 in0
Convolution              convclip_9               1 1 in0 1 0=32 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864 9=3
ConvolutionDepthWise     convdwclip_0             1 1 1 2 0=32 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=3
Convolution              conv_5                   1 1 2 3 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Convolution              convclip_10              1 1 3 4 0=96 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536 9=3
ConvolutionDepthWise     convdwclip_1             1 1 4 5 0=96 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864 7=96 9=3
Convolution              conv_7                   1 1 5 6 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Split                    splitncnn_0              1 2 6 7 8
Convolution              convclip_11              1 1 8 9 0=144 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456 9=3
ConvolutionDepthWise     convdwclip_2             1 1 9 10 0=144 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1296 7=144 9=3
Convolution              conv_9                   1 1 10 11 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456
BinaryOp                 add_0                    2 1 11 7 12 0=0
Split                    splitncnn_1              1 2 12 13 14
Convolution              convclip_12              1 1 13 15 0=144 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456 9=3
ConvolutionDepthWise     convdwclip_3             1 1 15 16 0=144 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1296 7=144 9=3
Convolution              conv_11                  1 1 16 17 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Split                    splitncnn_2              1 2 17 18 19
Convolution              convclip_13              1 1 19 20 0=192 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144 9=3
ConvolutionDepthWise     convdwclip_4             1 1 20 21 0=192 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192 9=3
Convolution              conv_13                  1 1 21 22 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
BinaryOp                 add_1                    2 1 22 18 23 0=0
Split                    splitncnn_3              1 2 23 24 25
Convolution              convclip_14              1 1 25 26 0=192 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144 9=3
ConvolutionDepthWise     convdwclip_5             1 1 26 27 0=192 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192 9=3
Convolution              conv_15                  1 1 27 28 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
BinaryOp                 add_2                    2 1 28 24 29 0=0
Split                    splitncnn_4              1 2 29 30 31
Convolution              convclip_15              1 1 30 32 0=192 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144 9=3
ConvolutionDepthWise     convdwclip_6             1 1 32 33 0=192 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1728 7=192 9=3
Convolution              conv_17                  1 1 33 34 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Split                    splitncnn_5              1 2 34 35 36
Convolution              convclip_16              1 1 36 37 0=384 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576 9=3
ConvolutionDepthWise     convdwclip_7             1 1 37 38 0=384 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3456 7=384 9=3
Convolution              conv_19                  1 1 38 39 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
BinaryOp                 add_3                    2 1 39 35 40 0=0
Split                    splitncnn_6              1 2 40 41 42
Convolution              convclip_17              1 1 42 43 0=384 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576 9=3
ConvolutionDepthWise     convdwclip_8             1 1 43 44 0=384 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3456 7=384 9=3
Convolution              conv_21                  1 1 44 45 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
BinaryOp                 add_4                    2 1 45 41 46 0=0
Split                    splitncnn_7              1 2 46 47 48
Convolution              convclip_18              1 1 48 49 0=384 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576 9=3
ConvolutionDepthWise     convdwclip_9             1 1 49 50 0=384 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3456 7=384 9=3
Convolution              conv_23                  1 1 50 51 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
BinaryOp                 add_5                    2 1 51 47 52 0=0
Convolution              convclip_19              1 1 52 53 0=384 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576 9=3
ConvolutionDepthWise     convdwclip_10            1 1 53 54 0=384 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3456 7=384 9=3
Convolution              conv_25                  1 1 54 55 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Split                    splitncnn_8              1 2 55 56 57
Convolution              convclip_20              1 1 57 58 0=576 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296 9=3
ConvolutionDepthWise     convdwclip_11            1 1 58 59 0=576 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 7=576 9=3
Convolution              conv_27                  1 1 59 60 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296
BinaryOp                 add_6                    2 1 60 56 61 0=0
Split                    splitncnn_9              1 2 61 62 63
Convolution              convclip_21              1 1 63 64 0=576 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296 9=3
ConvolutionDepthWise     convdwclip_12            1 1 64 65 0=576 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 7=576 9=3
Convolution              conv_29                  1 1 65 66 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296
BinaryOp                 add_7                    2 1 66 62 67 0=0
Split                    splitncnn_10             1 2 67 68 69
Convolution              convclip_22              1 1 68 70 0=576 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296 9=3
ConvolutionDepthWise     convdwclip_13            1 1 70 71 0=576 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=5184 7=576 9=3
Convolution              conv_31                  1 1 71 72 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=92160
Split                    splitncnn_11             1 2 72 73 74
Convolution              convclip_23              1 1 74 75 0=960 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=153600 9=3
ConvolutionDepthWise     convdwclip_14            1 1 75 76 0=960 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=8640 7=960 9=3
Convolution              conv_33                  1 1 76 77 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=153600
BinaryOp                 add_8                    2 1 77 73 78 0=0
Split                    splitncnn_12             1 2 78 79 80
Convolution              convclip_24              1 1 80 81 0=960 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=153600 9=3
ConvolutionDepthWise     convdwclip_15            1 1 81 82 0=960 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=8640 7=960 9=3
Convolution              conv_35                  1 1 82 83 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=153600
BinaryOp                 add_9                    2 1 83 79 84 0=0
Convolution              convclip_25              1 1 84 85 0=960 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=153600 9=3
ConvolutionDepthWise     convdwclip_16            1 1 85 86 0=960 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=8640 7=960 9=3
Convolution              conv_37                  1 1 86 87 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=307200
Split                    splitncnn_13             1 2 87 88 89
ConvolutionDepthWise     convdw_110               1 1 69 90 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
Convolution              convrelu_0               1 1 90 91 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288 9=1
ConvolutionDepthWise     convdw_111               1 1 31 92 0=32 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=800 7=32
Convolution              convrelu_1               1 1 92 93 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072 9=1
ConvolutionDepthWise     convdw_112               1 1 14 94 0=24 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=600 7=24
Convolution              convrelu_2               1 1 94 95 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536 9=1
ConvolutionDepthWise     convdw_113               1 1 89 96 0=320 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2880 7=320
Convolution              convrelu_3               1 1 96 97 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=40960 9=1
ConvolutionDepthWise     convdw_114               1 1 88 98 0=320 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=8000 7=320
Convolution              convrelu_4               1 1 98 99 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=40960 9=1
BinaryOp                 add_10                   2 1 97 99 100 0=0
Interp                   upsample_1               1 1 100 101 0=2 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_0                    2 1 91 101 102 0=0
Split                    splitncnn_14             1 2 102 103 104
ConvolutionDepthWise     convdw_115               1 1 104 105 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Convolution              convrelu_5               1 1 105 106 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576 9=1
ConvolutionDepthWise     convdw_116               1 1 103 107 0=256 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6400 7=256
Convolution              convrelu_6               1 1 107 108 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576 9=1
BinaryOp                 add_11                   2 1 106 108 109 0=0
Interp                   upsample_2               1 1 109 110 0=2 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_1                    2 1 93 110 111 0=0
Split                    splitncnn_15             1 2 111 112 113
ConvolutionDepthWise     convdw_117               1 1 113 114 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192
Convolution              convrelu_7               1 1 114 115 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288 9=1
ConvolutionDepthWise     convdw_118               1 1 112 116 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192
Convolution              convrelu_8               1 1 116 117 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288 9=1
BinaryOp                 add_12                   2 1 115 117 118 0=0
Interp                   upsample_3               1 1 118 119 0=2 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_2                    2 1 95 119 120 0=0
Split                    splitncnn_16             1 3 120 121 122 123
ConvolutionDepthWise     convdw_119               1 1 123 124 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Convolution              convsigmoid_26           1 1 124 out0 0=13 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1664 9=4
ConvolutionDepthWise     convdw_120               1 1 122 126 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Convolution              conv_48                  1 1 126 out2 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
ConvolutionDepthWise     convdw_121               1 1 121 128 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Convolution              conv_49                  1 1 128 129 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
BinaryOp                 mul_13                   1 1 129 out1 0=2 1=1 2=1.600000e+01
